restaurant/app/controllers/home_controller.rb

    	#query using homelat/homelong - preload data for toggle
    	@home_suggestions = RestaurantVital.select("*").where("restaurant_vital.restaurant_type ilike any ( array[?] ) AND ( distance ( latitude::REAL, longitude::REAL, ?::REAL, ?::REAL ) / 1609.344 ) <= 5", prefsStr, homelat, homelong ).joins("JOIN restaurant_theme ON restaurant_vital.id = restaurant_theme.id JOIN restaurant_times ON restaurant_times.id = restaurant_vital.id").where("char_length(price) <= ? AND rating::REAL >= 3.0", maxPrice).limit(3).order("RANDOM()")
    	#try to handle "dead zones" where user's preferences are too specific for the area
    	if @home_suggestions.length < 2
---
SELECT  "restaurant_vital".* FROM "restaurant_vital" WHERE (restaurant_type ilike any ( array['%italian%','%sushi%'] )) ORDER BY RANDOM() LIMIT $1  [["LIMIT", 4]]